-- [미션1] 판매기록 조회하기

-- 판매기록을 product 테이블과 연결해 출력해 봅시다.
-- 이때 product테이블이 중심이 되도록 해 봅시다.
select * from sale
right join product
on product.id = sale.product_id;

+------+------------+--------+--------+----+------------+-------+-----------------+------------+---------------+---------------+
| id   | product_id | amount | money  | id | name       | stock | expiration_date | list_price | selling_price | discount_rate |
+------+------------+--------+--------+----+------------+-------+-----------------+------------+---------------+---------------+
|    1 |          1 |     10 |   9000 |  1 | carrot     |   100 | 2019-04-10      |       1000 |           900 |           0.9 |
|    2 |          1 |      5 |   4500 |  1 | carrot     |   100 | 2019-04-10      |       1000 |           900 |           0.9 |
|    8 |          1 |      1 |    900 |  1 | carrot     |   100 | 2019-04-10      |       1000 |           900 |           0.9 |
|    5 |          2 |    100 |  90000 |  2 | tea        |  1000 | 2020-02-10      |       1000 |           900 |           0.9 |
|    7 |          2 |     10 |   9000 |  2 | tea        |  1000 | 2020-02-10      |       1000 |           900 |           0.9 |
|    4 |          3 |      1 | 180000 |  3 | clock      |   100 | NULL            |     200000 |        180000 |           0.9 |
|   10 |          3 |      1 | 180000 |  3 | clock      |   100 | NULL            |     200000 |        180000 |           0.9 |
|    3 |          4 |      1 |  10000 |  4 | trump card |   100 | NULL            |      10000 |         10000 |             1 |
|    6 |          5 |     20 |  36000 |  5 | onion      |   100 | 2019-04-11      |       2000 |          1800 |           0.9 |
|    9 |          5 |     10 |  18000 |  5 | onion      |   100 | 2019-04-11      |       2000 |          1800 |           0.9 |
+------+------------+--------+--------+----+------------+-------+-----------------+------------+---------------+---------------+

-- [미션2] 인기 있는 물건

-- 지시사항을 만족하는 쿼리를 작성해보세요.
-- select * from sale limit 5;
select name, sum(amount)
from sale group by name
having sum(revenue) >= '5.0E4';

+----------+-------------+
| name     | sum(amount) |
+----------+-------------+
| carrot   |         110 |
| clock    |           2 |
| onion    |          30 |
| umbrella |           5 |
+----------+-------------+

-- [미션3] 부서별 인원 수 검색하기
select dept, count(*)
from employees group by dept;

+-----------+----------+
| dept      | count(*) |
+-----------+----------+
| 생산부    |        5 |
| 영업부    |        6 |
| 인사부    |        4 |
| 재무부    |        2 |
+-----------+----------+

