-- 02 데이터를 제어하는 DML
-- [실습1] 데이터에서 유사한 값 찾기 - LIKE
-- 입사 날짜가 7과 관련된 직원들에게 선물을 주는 이벤트를 진행하려고 합니다.

-- 앞서 배운 SELECT에 LIKE문을 추가하여 hire_date에 조건을 넣어 employees 테이블에서 검색해보세요.


-- 지시사항
-- employees 테이블에서 '1997-07-07' 일 입사한 회원을 검색해보세요.
-- 검색할 때는 모든 컬럼을 검색하도록 합시다.
-- Tips
-- LIKE 문은 대소문자를 우선순위로 구분합니다. 예를 들어 th로 검색을 한다면 th, Th, TH 순으로 정렬되어 검색합니다.

DESC employees;
select * from employees;

-- 아래에 hire_date가 1997-07-07인 직원만 조회하는 쿼리를 작성해주세요.
-- LIKE 문은 대소문자를 우선순위로 구분합니다. 예를 들어 th로 검색을 한다면 th, Th, TH 순으로 정렬되어 검색합니다.
select * from employees
where hire_date like '1997-07-07';

+-------------+---------------+------+-----+---------+-------+
| Field       | Type          | Null | Key | Default | Extra |
+-------------+---------------+------+-----+---------+-------+
| emp_no      | int(11)       | NO   | PRI | NULL    |       |
| birth_date  | date          | NO   |     | NULL    |       |
| first_name  | varchar(14)   | NO   |     | NULL    |       |
| last_name   | varchar(16)   | NO   |     | NULL    |       |
| gender      | enum('M','F') | NO   |     | NULL    |       |
| hire_date   | date          | NO   |     | NULL    |       |
| superior_no | int(11)       | YES  | MUL | NULL    |       |
+-------------+---------------+------+-----+---------+-------+
+--------+------------+------------+---------------+--------+------------+-------------+
| emp_no | birth_date | first_name | last_name     | gender | hire_date  | superior_no |
+--------+------------+------------+---------------+--------+------------+-------------+
|  10001 | 1953-09-02 | Georgi     | Facello       | M      | 1986-06-26 |        NULL |
|  10002 | 1964-06-02 | Bezalel    | Simmel        | F      | 1985-11-21 |        NULL |
|  10004 | 1954-05-01 | Chirstian  | Koblick       | M      | 1986-06-26 |        NULL |
|  10006 | 1953-04-20 | Anneke     | Preusig       | F      | 1989-06-02 |       10002 |
|  10008 | 1958-02-19 | Chirstian  | Kalloufi      | M      | 1994-09-15 |       16258 |
|  10010 | 1963-06-01 | Duangkaew  | Piveteau      | F      | 1989-08-24 |       15256 |
|  10257 | 1957-09-12 | Aiman      | Riexinger     | M      | 1986-08-05 |        NULL |
|  10909 | 1954-11-11 | Georgi     | Atchley       | M      | 1985-04-21 |        NULL |
|  11259 | 1964-11-24 | Chirstian  | Vesel         | M      | 1986-06-26 |        NULL |
|  11430 | 1957-01-23 | Georgi     | Lueh          | M      | 1997-07-07 |       12258 |
|  11542 | 1964-11-24 | Susanna    | Vesel         | M      | 1986-06-25 |        NULL |
|  12258 | 1955-12-12 | Susanna    | Rosiles       | F      | 1985-05-17 |        NULL |
|  14201 | 1964-07-03 | Chirstian  | Lueh          | M      | 1991-07-26 |       15087 |
|  15087 | 1954-10-11 | Chirstian  | Ushiama       | F      | 1988-09-14 |        NULL |
|  15103 | 1964-04-05 | Eran       | Rosiles       | M      | 1997-07-07 |       10002 |
|  15256 | 1960-12-02 | Irene      | Radhakrishnan | M      | 1987-10-12 |        NULL |
|  16258 | 1955-12-12 | Basil      | Ishibashi     | F      | 1985-05-17 |        NULL |
|  16670 | 1958-06-28 | Kenton     | Azumi         | M      | 1988-12-21 |       12258 |
|  16671 | 1956-01-14 | Kish       | Orlowska      | M      | 1986-07-08 |        NULL |
|  16672 | 1955-04-25 | Georgi     | Peris         | M      | 1986-06-26 |       12258 |
|  18257 | 1957-09-12 | Aiman      | Riexinger     | M      | 1986-08-05 |        NULL |
|  19220 | 1957-08-03 | Georgi     | Panienski     | F      | 1995-08-24 |       16258 |
+--------+------------+------------+---------------+--------+------------+-------------+

+--------+------------+------------+-----------+--------+------------+-------------+
| emp_no | birth_date | first_name | last_name | gender | hire_date  | superior_no |
+--------+------------+------------+-----------+--------+------------+-------------+
|  11430 | 1957-01-23 | Georgi     | Lueh      | M      | 1997-07-07 |       12258 |
|  15103 | 1964-04-05 | Eran       | Rosiles   | M      | 1997-07-07 |       10002 |
+--------+------------+------------+-----------+--------+------------+-------------+

-- [실습2] 와일드 카드를 사용한 검색 - LIKE, WILDCARDS 1
-- 영어단어 The Little로 시작하는 책과 영어단어 and가 포함돼 있는 책과 Rings로 끝나는 책을 빌리는 이용자들만 따로 추첨하는 이벤트를 진행하려고 합니다.

-- 해당 이벤트를 시작하기 전에 먼저 The Little로 시작하는 책과 and가 포함된 책과 Rings로 끝나는 책만 공지하여 봅시다.

-- 앞서 배운 SELECT에 LIKE문을 추가하여 책 제목에 여러 가지 조건을 넣어 원하는 책만 조회해 보세요.


-- 지시사항
-- book테이블에서 The Little로 시작하는 책을 검색해보세요.
-- book테이블에서 and가 포함된 책을 검색해보세요.
-- book테이블에서 Rings로 끝나는 책을 검색해보세요.
-- 출력할 때는 모든 컬럼을 출력하도록 합시다.

-- 책들의 정보가 담겨있는 테이블의 구조를 조회합니다. 수정하실 필요는 없습니다.
DESC book;
select * from book;
-- 아래에 제목이 The Little로 시작하는 책만 조회하는 쿼리를 작성해주세요.
select * from book
where title like 'The Little%';
-- 아래에 제목에 and가 포함된 책만 조회하는 쿼리를 작성해주세요.
select * from book
where title like '%and%';
-- 아래에 제목이 Rings로 끝나는 책만 조회하는 쿼리를 작성해주세요.
select * from book
where title like '%Rings';

+---------------+-------------+------+-----+---------+-------+
| Field         | Type        | Null | Key | Default | Extra |
+---------------+-------------+------+-----+---------+-------+
| id            | int(11)     | NO   | PRI | NULL    |       |
| title         | varchar(64) | NO   |     | NULL    |       |
| author        | varchar(16) | YES  |     | NULL    |       |
| publisher     | varchar(32) | YES  |     | NULL    |       |
| date_received | date        | YES  |     | NULL    |       |
+---------------+-------------+------+-----+---------+-------+
+------+------------------------------------------+------------------+-----------------------+---------------+
| id   | title                                    | author           | publisher             | date_received |
+------+------------------------------------------+------------------+-----------------------+---------------+
| 1000 | Romeo and Juliet                         | William Shakespe | NULL                  | 2012-04-01    |
| 1001 | Don Quixote                              | Miguel de Cervan | NULL                  | 2015-03-31    |
| 1002 | The Little Prince                        | Antoine de Saint | NULL                  | 2018-12-21    |
| 1003 | Harry Potter and the Philosopher's Stone | Joanne Kathleen  | Bloomsbury Publishing | 2017-06-26    |
| 1004 | The Lord of the Rings                    | John Ronald Reue | Allen & Unwin         | 2014-07-29    |
+------+------------------------------------------+------------------+-----------------------+---------------+

+------+-------------------+------------------+-----------+---------------+
| id   | title             | author           | publisher | date_received |
+------+-------------------+------------------+-----------+---------------+
| 1002 | The Little Prince | Antoine de Saint | NULL      | 2018-12-21    |
+------+-------------------+------------------+-----------+---------------+
+------+------------------------------------------+------------------+-----------------------+---------------+
| id   | title                                    | author           | publisher             | date_received |
+------+------------------------------------------+------------------+-----------------------+---------------+
| 1000 | Romeo and Juliet                         | William Shakespe | NULL                  | 2012-04-01    |
| 1003 | Harry Potter and the Philosopher's Stone | Joanne Kathleen  | Bloomsbury Publishing | 2017-06-26    |
+------+------------------------------------------+------------------+-----------------------+---------------+
+------+-----------------------+------------------+---------------+---------------+
| id   | title                 | author           | publisher     | date_received |
+------+-----------------------+------------------+---------------+---------------+
| 1004 | The Lord of the Rings | John Ronald Reue | Allen & Unwin | 2014-07-29    |
+------+-----------------------+------------------+---------------+---------------+


-- [실습3] 와일드 카드를 사용한 검색 - LIKE, WILDCARDS 2
-- 다시 한 번 입사 날짜과 7과 관련된 직원들에게 선물을 주는 이벤트를 진행하려고 합니다.

-- 다만 이번에는 좀 더 많은 인원들에게 상품을 주기 위해 hire_date에 7이 들어가기만 하면 상품을 주려고 합니다. 해당 하는 사람들을 employees 테이블에서 검색해 봅시다.

-- 앞서 배운 SELECT에 LIKE문과 와일드 카드(%) 를 추가하여 hire_date에 여러 가지 조건을 넣어 원하는 직원만 검색해보세요.


-- 지시사항
-- employees 테이블에서 hire_date에 7이 들어가는 직원들을 검색해보세요.
-- 검색할 때는 모든 컬럼을 검색하도록 합시다.

DESC employees;
select * from employees;
-- 아래에 hire_date에 7이 들어가는 직원을 조회하는 쿼리를 작성해주세요.
select * from employees
where hire_date like '%7%';

+-------------+---------------+------+-----+---------+-------+
| Field       | Type          | Null | Key | Default | Extra |
+-------------+---------------+------+-----+---------+-------+
| emp_no      | int(11)       | NO   | PRI | NULL    |       |
| birth_date  | date          | NO   |     | NULL    |       |
| first_name  | varchar(14)   | NO   |     | NULL    |       |
| last_name   | varchar(16)   | NO   |     | NULL    |       |
| gender      | enum('M','F') | NO   |     | NULL    |       |
| hire_date   | date          | NO   |     | NULL    |       |
| superior_no | int(11)       | YES  | MUL | NULL    |       |
+-------------+---------------+------+-----+---------+-------+
+--------+------------+------------+---------------+--------+------------+-------------+
| emp_no | birth_date | first_name | last_name     | gender | hire_date  | superior_no |
+--------+------------+------------+---------------+--------+------------+-------------+
|  10001 | 1953-09-02 | Georgi     | Facello       | M      | 1986-06-26 |       10002 |
|  10002 | 1964-06-02 | Bezalel    | Simmel        | F      | 1985-11-21 |        NULL |
|  10004 | 1954-05-01 | Chirstian  | Koblick       | M      | 1986-06-26 |        NULL |
|  10006 | 1953-04-20 | Anneke     | Preusig       | F      | 1989-06-02 |       12258 |
|  10008 | 1958-02-19 | Chirstian  | Kalloufi      | M      | 1994-09-15 |       16258 |
|  10010 | 1963-06-01 | Duangkaew  | Piveteau      | F      | 1989-08-24 |       11542 |
|  10257 | 1957-09-12 | Aiman      | Riexinger     | M      | 1986-08-05 |       16258 |
|  10909 | 1954-11-11 | Georgi     | Atchley       | M      | 1985-04-21 |        NULL |
|  11259 | 1964-11-24 | Chirstian  | Vesel         | M      | 1986-06-26 |        NULL |
|  11430 | 1957-01-23 | Georgi     | Lueh          | M      | 1997-07-07 |       10004 |
|  11542 | 1964-11-24 | Susanna    | Vesel         | M      | 1986-06-25 |        NULL |
|  12258 | 1955-12-12 | Susanna    | Rosiles       | F      | 1985-05-17 |        NULL |
|  14201 | 1964-07-03 | Chirstian  | Lueh          | M      | 1991-07-26 |       12258 |
|  15087 | 1954-10-11 | Chirstian  | Ushiama       | F      | 1988-09-14 |       12258 |
|  15103 | 1964-04-05 | Eran       | Rosiles       | M      | 1997-07-07 |       10004 |
|  15256 | 1960-12-02 | Irene      | Radhakrishnan | M      | 1987-10-12 |        NULL |
|  16258 | 1955-12-12 | Basil      | Ishibashi     | F      | 1985-05-17 |        NULL |
|  16670 | 1958-06-28 | Kenton     | Azumi         | M      | 1988-12-21 |        NULL |
|  16671 | 1956-01-14 | Kish       | Orlowska      | M      | 1986-07-08 |        NULL |
|  16672 | 1955-04-25 | Georgi     | Peris         | M      | 1986-06-26 |        NULL |
|  18257 | 1957-09-12 | Aiman      | Riexinger     | M      | 1986-08-05 |       12258 |
|  19220 | 1957-08-03 | Georgi     | Panienski     | F      | 1995-08-24 |       16258 |
+--------+------------+------------+---------------+--------+------------+-------------+

+--------+------------+------------+---------------+--------+------------+-------------+
| emp_no | birth_date | first_name | last_name     | gender | hire_date  | superior_no |
+--------+------------+------------+---------------+--------+------------+-------------+
|  11430 | 1957-01-23 | Georgi     | Lueh          | M      | 1997-07-07 |       10004 |
|  12258 | 1955-12-12 | Susanna    | Rosiles       | F      | 1985-05-17 |        NULL |
|  14201 | 1964-07-03 | Chirstian  | Lueh          | M      | 1991-07-26 |       12258 |
|  15103 | 1964-04-05 | Eran       | Rosiles       | M      | 1997-07-07 |       10004 |
|  15256 | 1960-12-02 | Irene      | Radhakrishnan | M      | 1987-10-12 |        NULL |
|  16258 | 1955-12-12 | Basil      | Ishibashi     | F      | 1985-05-17 |        NULL |
|  16671 | 1956-01-14 | Kish       | Orlowska      | M      | 1986-07-08 |        NULL |
+--------+------------+------------+---------------+--------+------------+-------------+

-- [실습4] 데이터 정렬하기 - ORDER BY 1
-- 책들을 정리해서 조회하기로 하였는데, 내부의 id를 기준으로 출력하니 이용자들이 혼란에 빠졌습니다.

-- 이번에는 책 제목을 기준으로 오름차순 정렬로 조회해보고자 합니다.


-- 지시사항
-- book 테이블에서 SELECT문에 ORDER BY문을 추가하여 책 제목을 기준으로 오름차순 정렬로 조회해 봅시다.
-- 출력할 때는 *을 이용해 모든 컬럼을 출력하도록 합니다.

--- book 테이블의 구조를 조회합니다. 수정하실 필요는 없습니다.
DESC book;
select * from book;

-- book 테이블의 내용을 조회해 봅시다. 이때 책 제목을 기준으로 오름차순으로 조회해 봅시다.

select * from book
order by title ASC;

+---------------+-------------+------+-----+---------+-------+
| Field         | Type        | Null | Key | Default | Extra |
+---------------+-------------+------+-----+---------+-------+
| id            | int(11)     | NO   | PRI | NULL    |       |
| title         | varchar(64) | NO   |     | NULL    |       |
| author        | varchar(64) | YES  |     | NULL    |       |
| publisher     | varchar(32) | YES  |     | NULL    |       |
| date_received | date        | YES  |     | NULL    |       |
+---------------+-------------+------+-----+---------+-------+
+------+------------------------------------------+------------------------------+-----------------------+---------------+
| id   | title                                    | author                       | publisher             | date_received |
+------+------------------------------------------+------------------------------+-----------------------+---------------+
| 1000 | Romeo and Juliet                         | William Shakespeare          | NULL                  | 2012-04-01    |
| 1001 | Don Quixote                              | Miguel de Cervantes Saavedra | NULL                  | 2015-03-31    |
| 1002 | The Little Prince                        | Antoine de Saint-Exupery     | NULL                  | 2018-12-21    |
| 1003 | Harry Potter and the Philosopher's Stone | Joanne Kathleen Rowling      | Bloomsbury Publishing | 2017-06-26    |
| 1004 | The Lord of the Rings                    | John Ronald Reuel Tolkien    | Allen & Unwin         | 2014-07-29    |
+------+------------------------------------------+------------------------------+-----------------------+---------------+

+------+------------------------------------------+------------------------------+-----------------------+---------------+
| id   | title                                    | author                       | publisher             | date_received |
+------+------------------------------------------+------------------------------+-----------------------+---------------+
| 1001 | Don Quixote                              | Miguel de Cervantes Saavedra | NULL                  | 2015-03-31    |
| 1003 | Harry Potter and the Philosopher's Stone | Joanne Kathleen Rowling      | Bloomsbury Publishing | 2017-06-26    |
| 1000 | Romeo and Juliet                         | William Shakespeare          | NULL                  | 2012-04-01    |
| 1002 | The Little Prince                        | Antoine de Saint-Exupery     | NULL                  | 2018-12-21    |
| 1004 | The Lord of the Rings                    | John Ronald Reuel Tolkien    | Allen & Unwin         | 2014-07-29    |
+------+------------------------------------------+------------------------------+-----------------------+---------------+

-- [실습5] 데이터 정렬하기 - ORDER BY 2
-- salaries 테이블에는 직원들의 연도별 연봉이 들어있습니다.

-- 연봉을 정리해서 조회하기로 하였는데, 내부의 emp_no을 기준으로 출력하니 이용자들이 혼란에 빠졌습니다.

-- 이번에는 연봉액을 기준으로 오름차순 정렬로 검색하고자 합니다.


-- 지시사항
-- salaries 테이블에서 SELECT문에 ORDER BY문을 추가하여 salary를 기준으로 오름차순 정렬로 검색해봅시다.
-- 검색할 때는 *을 이용해 모든 컬럼을 검색하도록 합니다.

DESC salaries;
select * from salaries;
-- salaries 테이블의 내용을 출력해 봅시다. 이때 연봉액 제목을 기준으로 오름차순으로 출력해 봅시다.
select * from salaries
order by salary asc;

+-----------+---------+------+-----+---------+-------+
| Field     | Type    | Null | Key | Default | Extra |
+-----------+---------+------+-----+---------+-------+
| emp_no    | int(11) | NO   |     | NULL    |       |
| salary    | int(11) | NO   |     | NULL    |       |
| from_date | date    | NO   |     | NULL    |       |
| to_date   | date    | NO   |     | NULL    |       |
+-----------+---------+------+-----+---------+-------+
+--------+--------+------------+------------+
| emp_no | salary | from_date  | to_date    |
+--------+--------+------------+------------+
|  10001 |  62102 | 1987-06-26 | 1988-06-25 |
|  10001 |  66074 | 1988-06-25 | 1989-06-25 |
|  10001 |  66596 | 1989-06-25 | 1990-06-25 |
|  10001 |  66961 | 1990-06-25 | 1991-06-25 |
|  10001 |  71046 | 1991-06-25 | 1992-06-24 |
|  10001 |  74333 | 1992-06-24 | 1993-06-24 |
|  10001 |  76884 | 1995-06-24 | 1996-06-23 |
|  10001 |  80013 | 1996-06-23 | 1997-06-23 |
|  10001 |  81025 | 1997-06-23 | 1998-06-23 |
|  10001 |  81097 | 1998-06-23 | 1999-06-23 |
|  10001 |  84917 | 1999-06-23 | 2000-06-22 |
|  10002 |  65828 | 1996-08-03 | 1997-08-03 |
|  10002 |  65909 | 1997-08-03 | 1998-08-03 |
|  10002 |  67534 | 1998-08-03 | 1999-08-03 |
|  10002 |  69366 | 1999-08-03 | 2000-08-02 |
|  10002 |  71963 | 2000-08-02 | 2001-08-02 |
|  10002 |  72527 | 2001-08-02 | 9999-01-01 |
|  10003 |  40006 | 1995-12-03 | 1996-12-02 |
|  10003 |  43616 | 1996-12-02 | 1997-12-02 |
|  10003 |  43311 | 2001-12-01 | 9999-01-01 |
|  10004 |  40054 | 1986-12-01 | 1987-12-01 |
|  10004 |  42283 | 1987-12-01 | 1988-11-30 |
|  10004 |  42542 | 1988-11-30 | 1989-11-30 |
|  10004 |  46065 | 1989-11-30 | 1990-11-30 |
|  10004 |  58326 | 1994-11-29 | 1995-11-29 |
|  10004 |  60770 | 1995-11-29 | 1996-11-28 |
|  10004 |  62566 | 1996-11-28 | 1997-11-28 |
|  10004 |  64340 | 1997-11-28 | 1998-11-28 |
|  10004 |  67096 | 1998-11-28 | 1999-11-28 |
|  10004 |  69722 | 1999-11-28 | 2000-11-27 |
|  10004 |  70698 | 2000-11-27 | 2001-11-27 |
|  10004 |  74057 | 2001-11-27 | 9999-01-01 |
|  10005 |  78228 | 1989-09-12 | 1990-09-12 |
|  10005 |  82621 | 1990-09-12 | 1991-09-12 |
|  10005 |  88063 | 1996-09-10 | 1997-09-10 |
|  10005 |  89724 | 1997-09-10 | 1998-09-10 |
|  10005 |  90392 | 1998-09-10 | 1999-09-10 |
|  10005 |  90531 | 1999-09-10 | 2000-09-09 |
|  10005 |  91453 | 2000-09-09 | 2001-09-09 |
|  10005 |  94692 | 2001-09-09 | 9999-01-01 |
|  10006 |  40000 | 1990-08-05 | 1991-08-05 |
|  10006 |  42085 | 1991-08-05 | 1992-08-04 |
|  10006 |  42629 | 1992-08-04 | 1993-08-04 |
|  10006 |  45844 | 1993-08-04 | 1994-08-04 |
|  10006 |  47518 | 1994-08-04 | 1995-08-04 |
|  10006 |  47917 | 1995-08-04 | 1996-08-03 |
|  10006 |  52255 | 1996-08-03 | 1997-08-03 |
|  10006 |  53747 | 1997-08-03 | 1998-08-03 |
|  10007 |  62745 | 1991-02-10 | 1992-02-10 |
|  10007 |  63475 | 1992-02-10 | 1993-02-09 |
|  10007 |  63208 | 1993-02-09 | 1994-02-09 |
|  10007 |  64563 | 1994-02-09 | 1995-02-09 |
+--------+--------+------------+------------+

+--------+--------+------------+------------+
| emp_no | salary | from_date  | to_date    |
+--------+--------+------------+------------+
|  10006 |  40000 | 1990-08-05 | 1991-08-05 |
|  10003 |  40006 | 1995-12-03 | 1996-12-02 |
|  10004 |  40054 | 1986-12-01 | 1987-12-01 |
|  10006 |  42085 | 1991-08-05 | 1992-08-04 |
|  10004 |  42283 | 1987-12-01 | 1988-11-30 |
|  10004 |  42542 | 1988-11-30 | 1989-11-30 |
|  10006 |  42629 | 1992-08-04 | 1993-08-04 |
|  10003 |  43311 | 2001-12-01 | 9999-01-01 |

-- [실습6] 새로운 데이터 삽입하기
-- 주식회사 엘리스에 신입사원이 입사했습니다.

-- employees 테이블의 구조를 참고하여 신입사원의 정보를 데이터베이스에 넣어봅시다.


-- 지시사항
-- 아래의 정보를 employees 테이블에 넣어보세요.
-- emp_no : 10001
-- birth_date : '1953-09-02'
-- first_name : 'Georgi'
-- last_name : 'Facello'
-- gender : 'M'
-- hire_date : '1986-06-26'
-- superior_no : NULL
-- Copy
-- Tips
-- 정수, 실수 자료형의 경우 그대로 작성하고 문자, 날짜 등은 작은따옴표 '로 감싸면 됩니다.
-- 오타에 신경써서 값을 넣고 값을 잘 넣었는지 검색문을 이용해 확인해보세요.

-- INSERT문을 이용해 쿼리를 작성해 보세요.
-- 정수, 실수 자료형의 경우 그대로 작성하고 문자, 날짜 등은 작은따옴표 '로 감싸면 됩니다.
DESC employees;

INSERT INTO employees
(emp_no,birth_date,
first_name,last_name,gender,
hire_date,superior_no)

VALUES (10001,'1953-09-02',
'Georgi','Facello','M',
'1986-06-26',NULL);


-- 값을 잘 넣었는지 확인하는 코드입니다. 수정하지마세요!
SELECT * FROM employees;

+-------------+---------------+------+-----+---------+-------+
| Field       | Type          | Null | Key | Default | Extra |
+-------------+---------------+------+-----+---------+-------+
| emp_no      | int(11)       | NO   | PRI | NULL    |       |
| birth_date  | date          | NO   |     | NULL    |       |
| first_name  | varchar(14)   | NO   |     | NULL    |       |
| last_name   | varchar(16)   | NO   |     | NULL    |       |
| gender      | enum('M','F') | NO   |     | NULL    |       |
| hire_date   | date          | NO   |     | NULL    |       |
| superior_no | int(11)       | YES  |     | NULL    |       |
+-------------+---------------+------+-----+---------+-------+
+--------+------------+------------+-----------+--------+------------+-------------+
| emp_no | birth_date | first_name | last_name | gender | hire_date  | superior_no |
+--------+------------+------------+-----------+--------+------------+-------------+
|  10001 | 1953-09-02 | Georgi     | Facello   | M      | 1986-06-26 |        NULL |
+--------+------------+------------+-----------+--------+------------+-------------+

-- [실습7] 데이터 수정하기 1
-- 도서관에서는 대출과 반납 현황 역시 DB를 이용해 관리합니다.

-- 빌려 갈 때 rental 테이블에 값을 추가하는데 이때 반납시간은 NULL로 두었다가 반납할 때, 반납 시간을 기록합니다.

-- Elice 회원이 2019-04-05 12:00:30에 책을 반납하였습니다.

-- 이에 맞게 반납시간을 NULL에서 올바른 시간으로 변경해 봅시다.


-- 지시사항
-- Elice회원의 id는 1000번입니다. rental 테이블에 1000번 회원의 반납시간을 '2019-04-05 12:00:30' 로 바꿔봅시다.

-- 대출 반납의 정보가 담긴 테이블의 구조를 조회합니다. 수정하실 필요는 없습니다.
DESC rental;
select * from rental;

-- 반납 시간을 수정하는 쿼리를 작성해 보세요.
UPDATE rental
SET rental_end_date = '2019-04-05 12:00:30'
WHERE id = 1000;


-- 대출 반납 상태를 조회합니다. 반납시간이 올바르게 추가되었는지는 실행버튼을 통해 확인할 수 있습니다.
SELECT * FROM rental;

+-------------------+----------+------+-----+---------+-------+
| Field             | Type     | Null | Key | Default | Extra |
+-------------------+----------+------+-----+---------+-------+
| id                | int(11)  | NO   | PRI | NULL    |       |
| book_id           | int(11)  | NO   | MUL | NULL    |       |
| user_id           | int(11)  | NO   | MUL | NULL    |       |
| rental_begin_date | datetime | YES  |     | NULL    |       |
| rental_end_date   | datetime | YES  |     | NULL    |       |
+-------------------+----------+------+-----+---------+-------+

+------+---------+---------+---------------------+---------------------+
| id   | book_id | user_id | rental_begin_date   | rental_end_date     |
+------+---------+---------+---------------------+---------------------+
| 1000 |    1000 |    1000 | 2019-04-01 19:30:00 | NULL                |
| 1001 |    1000 |    1001 | 2019-02-20 12:00:00 | 2019-03-01 13:00:00 |
| 1002 |    1001 |    1001 | 2019-03-10 11:45:00 | 2019-04-01 10:10:10 |
+------+---------+---------+---------------------+---------------------+

+------+---------+---------+---------------------+---------------------+
| id   | book_id | user_id | rental_begin_date   | rental_end_date     |
+------+---------+---------+---------------------+---------------------+
| 1000 |    1000 |    1000 | 2019-04-01 19:30:00 | 2019-04-05 12:00:30 |
| 1001 |    1000 |    1001 | 2019-02-20 12:00:00 | 2019-03-01 13:00:00 |
| 1002 |    1001 |    1001 | 2019-03-10 11:45:00 | 2019-04-01 10:10:10 |
+------+---------+---------+---------------------+---------------------+


-- [실습8] 데이터 수정하기 2
-- 회사에서는 직원들을 관리하기 위한 데이터베이스를 관리합니다.

-- 직원들 정보가 들어있는 employees 테이블에 값이 잘못 입력된 것이 있습니다.

-- 신입사원 'Facello Georgi' 의 생년월일을 잘못 입력하여 수정하려고 합니다.

-- 'Facello Georgi' 의 직원 번호는 10001입니다.


-- 지시사항
-- employees 테이블에서 emp_no이 10001인 직원의 생년월일(birth_date)을 '1953-09-01' 으로 수정해보세요.

DESC employees;
SELECT * FROM employees;

-- UPDATE문을 이용해 쿼리를 작성해 보세요.

UPDATE employees
SET birth_date = '1953-09-01'
WHERE emp_no = 10001;
-- 값을 잘 수정했는지 확인하는 코드입니다. 수정하지마세요!
SELECT * FROM employees;

+-------------+---------------+------+-----+---------+-------+
| Field       | Type          | Null | Key | Default | Extra |
+-------------+---------------+------+-----+---------+-------+
| emp_no      | int(11)       | NO   | PRI | NULL    |       |
| birth_date  | date          | NO   |     | NULL    |       |
| first_name  | varchar(14)   | NO   |     | NULL    |       |
| last_name   | varchar(16)   | NO   |     | NULL    |       |
| gender      | enum('M','F') | NO   |     | NULL    |       |
| hire_date   | date          | NO   |     | NULL    |       |
| superior_no | int(11)       | YES  | MUL | NULL    |       |
+-------------+---------------+------+-----+---------+-------+
+--------+------------+------------+-----------+--------+------------+-------------+
| emp_no | birth_date | first_name | last_name | gender | hire_date  | superior_no |
+--------+------------+------------+-----------+--------+------------+-------------+
|  10001 | 1953-09-02 | Georgi     | Facello   | M      | 1986-06-26 |        NULL |
|  10002 | 1964-06-02 | Bezalel    | Simmel    | F      | 1985-11-21 |        NULL |
|  10003 | 1959-12-03 | Parto      | Bamford   | M      | 1986-08-28 |        NULL |
|  10004 | 1954-05-01 | Chirstian  | Koblick   | M      | 1986-12-01 |        NULL |
|  10005 | 1955-01-21 | Kyoichi    | Maliniak  | M      | 1989-09-12 |       10001 |
|  10006 | 1953-04-20 | Anneke     | Preusig   | F      | 1989-06-02 |       10002 |
|  10007 | 1957-05-23 | Tzvetan    | Zielinski | F      | 1989-02-10 |       10002 |
|  10008 | 1958-02-19 | Saniya     | Kalloufi  | M      | 1994-09-15 |        NULL |
|  10009 | 1952-04-19 | Sumant     | Peac      | F      | 1985-02-18 |        NULL |
|  10010 | 1963-06-01 | Duangkaew  | Piveteau  | F      | 1989-08-24 |       10001 |
+--------+------------+------------+-----------+--------+------------+-------------+

+--------+------------+------------+-----------+--------+------------+-------------+
| emp_no | birth_date | first_name | last_name | gender | hire_date  | superior_no |
+--------+------------+------------+-----------+--------+------------+-------------+
|  10001 | 1953-09-01 | Georgi     | Facello   | M      | 1986-06-26 |        NULL |
|  10002 | 1964-06-02 | Bezalel    | Simmel    | F      | 1985-11-21 |        NULL |
|  10003 | 1959-12-03 | Parto      | Bamford   | M      | 1986-08-28 |        NULL |
|  10004 | 1954-05-01 | Chirstian  | Koblick   | M      | 1986-12-01 |        NULL |
|  10005 | 1955-01-21 | Kyoichi    | Maliniak  | M      | 1989-09-12 |       10001 |
|  10006 | 1953-04-20 | Anneke     | Preusig   | F      | 1989-06-02 |       10002 |
|  10007 | 1957-05-23 | Tzvetan    | Zielinski | F      | 1989-02-10 |       10002 |
|  10008 | 1958-02-19 | Saniya     | Kalloufi  | M      | 1994-09-15 |        NULL |
|  10009 | 1952-04-19 | Sumant     | Peac      | F      | 1985-02-18 |        NULL |
|  10010 | 1963-06-01 | Duangkaew  | Piveteau  | F      | 1989-08-24 |       10001 |
+--------+------------+------------+-----------+--------+------------+-------------+


-- [실습9] 데이터 삭제하기 1
-- DELETE를 이용해 테이블의 데이터를 삭제해 봅시다.

-- 현재 도서관에서 잃어버린 책이 몇 권 있습니다.

-- 하지만 아직 도서관 DB에 남아있어 이용자들에게 혼란을 주는 상황입니다.

-- 여러분이 book 테이블에서 책들을 직접 지워봅시다.


-- 지시사항
-- book 테이블에서 아래 제목을 가진 책들을 데이터베이스에서 삭제하세요.
-- Harry Potter and the Philosopher's Stone
-- The Lord of the Rings
-- Tips
-- SQL에서 문자열 속에 '를 넣기 위해서는 \'로 넣어야 합니다.

DESC book;
select * from book;

-- 잃어버린 책 2권을 book 테이블에서 삭제하여 봅시다.
DELETE FROM book
WHERE title ='Harry Potter and the Philosopher\'s Stone';

DELETE FROM book
WHERE title ='The Lord of the Rings';


-- 전체 책의 정보와 회원정보를 조회합니다. 수정하실 필요는 없습니다.
SELECT * FROM book;


+---------------+-------------+------+-----+---------+-------+
| Field         | Type        | Null | Key | Default | Extra |
+---------------+-------------+------+-----+---------+-------+
| id            | int(11)     | NO   | PRI | NULL    |       |
| title         | varchar(64) | NO   |     | NULL    |       |
| author        | varchar(64) | YES  |     | NULL    |       |
| publisher     | varchar(32) | YES  |     | NULL    |       |
| date_received | date        | YES  |     | NULL    |       |
+---------------+-------------+------+-----+---------+-------+
+------+------------------------------------------+------------------------------+-----------------------+---------------+
| id   | title                                    | author                       | publisher             | date_received |
+------+------------------------------------------+------------------------------+-----------------------+---------------+
| 1000 | Romeo and Juliet                         | William Shakespeare          | NULL                  | 2012-04-01    |
| 1001 | Don Quixote                              | Miguel de Cervantes Saavedra | NULL                  | 2015-03-31    |
| 1002 | The Little Prince                        | Antoine de Saint-Exupery     | NULL                  | 2018-12-21    |
| 1003 | Harry Potter and the Philosopher's Stone | Joanne Kathleen Rowling      | Bloomsbury Publishing | 2017-06-26    |
| 1004 | The Lord of the Rings                    | John Ronald Reuel Tolkien    | Allen & Unwin         | 2014-07-29    |
+------+------------------------------------------+------------------------------+-----------------------+---------------+

+------+-------------------+------------------------------+-----------+---------------+
| id   | title             | author                       | publisher | date_received |
+------+-------------------+------------------------------+-----------+---------------+
| 1000 | Romeo and Juliet  | William Shakespeare          | NULL      | 2012-04-01    |
| 1001 | Don Quixote       | Miguel de Cervantes Saavedra | NULL      | 2015-03-31    |
| 1002 | The Little Prince | Antoine de Saint-Exupery     | NULL      | 2018-12-21    |
+------+-------------------+------------------------------+-----------+---------------+
'
-- [실습10] 데이터 삭제하기 2
-- DELETE를 이용해 테이블의 데이터를 삭제해 봅시다.

-- 현재 회사를 퇴사한 직원이 한 명 있습니다.

-- 하지만 아직 데이터베이스에 남아있어 이용자들에게 혼란을 주는 상황입니다.

-- employees 테이블에서 퇴사한 직원 'Maliniak Kyoichi' 를 삭제해봅시다.


-- 지시사항
-- employees 테이블에서 퇴사한 직원 'Maliniak Kyoichi' 을 데이터베이스에서 삭제해봅시다. 'Maliniak Kyoichi' 의 직원 번호는 10005입니다

DESC employees;
select * from employees;

-- DELETE문을 이용해 쿼리를 작성해 보세요.
-- employees 테이블에서 퇴사한 직원 'Maliniak Kyoichi' 을 데이터베이스에서 삭제해봅시다. 'Maliniak Kyoichi' 의 직원 번호는 10005입니다.
DELETE FROM employees
WHERE emp_no = 10005;

-- 값을 잘 삭제했는지 확인하는 코드입니다. 수정하지마세요!
SELECT * FROM employees;

+-------------+---------------+------+-----+---------+-------+
| Field       | Type          | Null | Key | Default | Extra |
+-------------+---------------+------+-----+---------+-------+
| emp_no      | int(11)       | NO   | PRI | NULL    |       |
| birth_date  | date          | NO   |     | NULL    |       |
| first_name  | varchar(14)   | NO   |     | NULL    |       |
| last_name   | varchar(16)   | NO   |     | NULL    |       |
| gender      | enum('M','F') | NO   |     | NULL    |       |
| hire_date   | date          | NO   |     | NULL    |       |
| superior_no | int(11)       | YES  | MUL | NULL    |       |
+-------------+---------------+------+-----+---------+-------+
+--------+------------+------------+-----------+--------+------------+-------------+
| emp_no | birth_date | first_name | last_name | gender | hire_date  | superior_no |
+--------+------------+------------+-----------+--------+------------+-------------+
|  10001 | 1953-09-01 | Georgi     | Facello   | M      | 1986-06-26 |        NULL |
|  10002 | 1964-06-02 | Bezalel    | Simmel    | F      | 1985-11-21 |        NULL |
|  10003 | 1959-12-03 | Parto      | Bamford   | M      | 1986-08-28 |        NULL |
|  10004 | 1954-05-01 | Chirstian  | Koblick   | M      | 1986-12-01 |        NULL |
|  10005 | 1955-01-21 | Kyoichi    | Maliniak  | M      | 1989-09-12 |       10001 |
|  10006 | 1953-04-20 | Anneke     | Preusig   | F      | 1989-06-02 |       10002 |
|  10007 | 1957-05-23 | Tzvetan    | Zielinski | F      | 1989-02-10 |       10002 |
|  10008 | 1958-02-19 | Saniya     | Kalloufi  | M      | 1994-09-15 |        NULL |
|  10009 | 1952-04-19 | Sumant     | Peac      | F      | 1985-02-18 |        NULL |
|  10010 | 1963-06-01 | Duangkaew  | Piveteau  | F      | 1989-08-24 |       10001 |
+--------+------------+------------+-----------+--------+------------+-------------+

+--------+------------+------------+-----------+--------+------------+-------------+
| emp_no | birth_date | first_name | last_name | gender | hire_date  | superior_no |
+--------+------------+------------+-----------+--------+------------+-------------+
|  10001 | 1953-09-01 | Georgi     | Facello   | M      | 1986-06-26 |        NULL |
|  10002 | 1964-06-02 | Bezalel    | Simmel    | F      | 1985-11-21 |        NULL |
|  10003 | 1959-12-03 | Parto      | Bamford   | M      | 1986-08-28 |        NULL |
|  10004 | 1954-05-01 | Chirstian  | Koblick   | M      | 1986-12-01 |        NULL |
|  10006 | 1953-04-20 | Anneke     | Preusig   | F      | 1989-06-02 |       10002 |
|  10007 | 1957-05-23 | Tzvetan    | Zielinski | F      | 1989-02-10 |       10002 |
|  10008 | 1958-02-19 | Saniya     | Kalloufi  | M      | 1994-09-15 |        NULL |
|  10009 | 1952-04-19 | Sumant     | Peac      | F      | 1985-02-18 |        NULL |
|  10010 | 1963-06-01 | Duangkaew  | Piveteau  | F      | 1989-08-24 |       10001 |
+--------+------------+------------+-----------+--------+------------+-------------+

