
-- [실습1] 데이터의 숫자 세어보기 - COUNT 1

-- 아래에 book테이블의 자료의 수와 user테이블의 자료의 수를 차례대로 조회해 봅시다.
select count(*) from book;

select count(*) from user;

+----------+
| count(*) |
+----------+
|        5 |
+----------+
+----------+
| count(*) |
+----------+
|        4 |
+----------+

-- [실습2] 데이터의 숫자 세어보기 - COUNT 2

-- employees테이블의 자료의 수를 조회해 봅시다.
select count(*) from employees;

+----------+
| count(*) |
+----------+
|       52 |
+----------+

-- [실습3] 데이터에서 상단 값만 출력하기 - LIMIT 1

-- book테이블의 모든 컬럼을 조회해 봅시다. 단 5권만 잘라서 출력해야 합니다.

select * from book limit 5;

+------+------------------------------------------+------------------+-----------------------+---------------+
| id   | title                                    | author           | publisher             | date_received |
+------+------------------------------------------+------------------+-----------------------+---------------+
| 1000 | Romeo and Juliet                         | William Shakespe | NULL                  | 2012-04-01    |
| 1001 | Don Quixote                              | Miguel de Cervan | NULL                  | 2015-03-31    |
| 1002 | The Little Prince                        | Antoine de Saint | NULL                  | 2018-12-21    |
| 1003 | Harry Potter and the Philosopher's Stone | Joanne Kathleen  | Bloomsbury Publishing | 2017-06-26    |
| 1004 | The Lord of the Rings                    | John Ronald Reue | Allen & Unwin         | 2014-07-29    |
+------+------------------------------------------+------------------+-----------------------+---------------+
'
-- [실습4] 데이터에서 상단 값만 출력하기 - LIMIT 2

-- salaries테이블의 모든 컬럼을 조회해 봅시다. 단 5개만 잘라서 출력해야 합니다.

select * from salaries limit 5;

+--------+--------+------------+------------+
| emp_no | salary | from_date  | to_date    |
+--------+--------+------------+------------+
|  10001 |  62102 | 1987-06-26 | 1988-06-25 |
|  10001 |  66074 | 1988-06-25 | 1989-06-25 |
|  10001 |  66596 | 1989-06-25 | 1990-06-25 |
|  10001 |  66961 | 1990-06-25 | 1991-06-25 |
|  10001 |  71046 | 1991-06-25 | 1992-06-24 |
+--------+--------+------------+------------+

-- [실습5] 데이터들의 합 구하기 - SUM

-- salary테이블의 연봉의 합을 구해봅시다.

select sum(salary) from salaries;

+-------------+
| sum(salary) |
+-------------+
|     3381317 |
+-------------+

-- [실습6] 데이터들의 평균 구하기 - AVG 1

DESC grade;

-- 학생들의 성적의 평균을 조회합니다.
select avg(korean),avg(english),avg(math) from grade;

+---------+-------------+------+-----+---------+-------+
| Field   | Type        | Null | Key | Default | Extra |
+---------+-------------+------+-----+---------+-------+
| id      | int(11)     | NO   | PRI | NULL    |       |
| name    | varchar(32) | NO   |     | NULL    |       |
| korean  | int(11)     | YES  |     | NULL    |       |
| english | int(11)     | YES  |     | NULL    |       |
| math    | int(11)     | YES  |     | NULL    |       |
+---------+-------------+------+-----+---------+-------+
+-------------+--------------+-----------+
| avg(korean) | avg(english) | avg(math) |
+-------------+--------------+-----------+
|     85.7143 |      77.1429 |   78.5714 |
+-------------+--------------+-----------+


-- [실습7] 데이터들의 평균 구하기 - AVG 2

-- salary테이블의 연봉의 평균을 구해봅시다.
select avg(salary) from salaries;

+-------------+
| avg(salary) |
+-------------+
|  65025.3269 |
+-------------+

-- [실습8] 데이터에서 최대값 찾기 - MAX 1

-- 학생들의 성적이 담겨있는 테이블의 구조를 조회합니다. 수정하실 필요는 없습니다.
DESC student;

-- 가장 높은 국어성적을 조회합니다.
select MAX(korean) from student;

+---------+-------------+------+-----+---------+-------+
| Field   | Type        | Null | Key | Default | Extra |
+---------+-------------+------+-----+---------+-------+
| name    | varchar(32) | NO   | PRI | NULL    |       |
| korean  | int(11)     | YES  |     | NULL    |       |
| english | int(11)     | YES  |     | NULL    |       |
| math    | int(11)     | YES  |     | NULL    |       |
+---------+-------------+------+-----+---------+-------+
+-------------+
| MAX(korean) |
+-------------+
|         100 |
+-------------+

[실습9] 데이터에서 최대값 찾기 - MAX 2

-- 가장 많은 연봉액을 구해봅시다.
select max(salary) from salaries;

+-------------+
| max(salary) |
+-------------+
|       94692 |
+-------------+

-- [실습10] 데이터에서 최소값 찾기 - MIN

-- 가장 적은 연봉액을 구해봅시다.

select min(salary) from salaries;

+-------------+
| min(salary) |
+-------------+
|       40000 |
+-------------+
